In [225]:
import mysql.connector
import pyodbc

In [226]:
my_db = mysql.connector.connect(
    host = "mysql8001.site4now.net",
    user = "a86ca8_anbujoe",
    password = "Qwerty@123",
    database = "db_a86ca8_anbujoe"
)

In [227]:
cursor = my_db.cursor()

In [203]:
query= """CREATE TABLE STUDENT5 (
                   NAME  VARCHAR(20) NOT NULL,
                   BRANCH VARCHAR(50),
                   ROLL INT NOT NULL,
                   SECTION VARCHAR(5),
                   AGE INT
                   )"""

In [228]:
query="Show tables"

In [229]:
cursor.execute(query)

In [230]:
for i in cursor:
    print(i)

('abishek',)
('abishek1',)
('abishek2',)
('aswin',)
('badboy',)
('badboymadhan',)
('class',)
('data',)
('data1fathi',)
('details',)
('diva',)
('employees',)
('giri',)
('giriprasath',)
('kailas',)
('kailash',)
('karthika',)
('kautham',)
('kevin',)
('maddy',)
('madhan',)
('mangena',)
('manoje',)
('persons',)
('preetha',)
('priya',)
('priya_masi',)
('priya_masi_31',)
('priyadharshi',)
('priyadharshini',)
('products',)
('sab',)
('sabana',)
('sangeetha',)
('sathana',)
('somu3',)
('stu1',)
('stud',)
('student',)
('student1',)
('student5',)
('student52',)
('students',)
('studentsid',)
('sushmi',)
('sushmitha',)
('suswetha',)
('tablem',)
('tabler',)
('vicky1',)
('viswa',)
('yogashree',)

In [232]:
cursor.execute("INSERT INTO STUDENT5 VALUES('SUDARSON','EEE','52','A','21')")

In [233]:
query="SELECT * FROM student5;"
cursor.execute(query)

In [234]:
for j in cursor:
    print(j)

('SUDARSON', 'EEE', 52, 'A', 21)

In [235]:
import pandas as pd

In [236]:
df=pd.read_sql(query,my_db)

In [237]:
df

       NAME BRANCH  ROLL SECTION  AGE
0  SUDARSON    EEE    52       A   21